Revit 2026 API

# DimensionEqualityLabelFormattingSuffix Property

---

The suffix to include after the parameter value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Suffix { get; set; }
```
```vb
Public Property Suffix As String
	Get
	Set
```
```cpp
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Suffix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DimensionEqualityLabelFormatting Class

Autodesk.Revit.DB Namespace